import streamlit as st

#Добавляємо назви класів
class_names = [
    "Токсичність", "Сильна токсичність", "Непристойність", "Загрози", "Образи", "Ненавість до ідентичності"
    ]

#Заговолок та невеликий опис
st.title("Класифікація токсичності коментарів")
st.write("У сучасному світі соціальних мереж існує значна проблема токсичності в онлайн-коментарях, що створює негативне середовище для спілкування. Від зловживань до образ - це може призвести до припинення обміну думками та ідеями серед користувачів. Цей застосунок створений для класифікації коментарів на різні види токсичності.")

#Кнопка для візуалізації назв класів
st.write("Які є види токсичності?")
if st.button("Показати"):       
    x = 1
    for i in class_names:
        st.write(f'{x} - {i}')
        x+=1

#Форма для вводу коментаря
input_text = st.text_area("Перевірте ваш коментар")


#Тут буде реалізація загрузки моделі та передбачення самого коментаря

#Вивід передбачення з використанням кольрових міток
if st.button('Перевірити'):
    if input_text=="tox":
        st.warning(f'Ваш коментар містить "{class_names[0]}"')
 